SET NAMES 'utf8';
DROP DATABASE IF EXISTS kaifanla_new;
CREATE DATABASE aiyou_visa CHARSET=UTF8;
USE aiyou_visa;
CREATE TABLE ay_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    name VARCHAR(64),
    price DOUBLE(6,2),
    detail VARCHAR(2048)
    );
INSERT INTO ay_dish VALUES
(   null,
    'p3142.jpeg',
    'p3142_l.jpg',
    '【法国】',
    250,
    '1、英文（需要显示个人信息、职位、年薪、出行时间、工作起始时间等）
2、抬头纸打印需盖章
3、领导亲笔签名（同行人不可相互签名，法人可以是人事签名）
42寸白底照片3张 必备材料'
),
(   null,
    'p2934.jpeg',
    'p2934_l.jpg',
    '【西班牙】',
    588,
    '1、护照必须在签证到期后180天有效；
2、至少有两页签证空白页（不含备注页）；
3、护照签字处需有本人亲笔签名；
4、如有旧护照，请提供旧护照原件。'
),
(   null,
    'm1123.jpeg',
    'm1123_l.jpg',
    '【马来西亚】',
    99,
    '1：护照首页扫描件jpg档2：近半年内标准2寸白底彩照jpg档自拍、翻拍、扫描等一律不可用，若提供此类照片我司不受理，敬请知悉）,主题命名为：马签+出行时间+人数+姓名+订单预留手机号'
),
(   null,
    'm1729.jpeg',
    'm1729_l.jpg',
    '【日本】',
    499,
    '1、资料备齐后，您可以将资料发送客服为您审核；
2、审核无误后，客服专员会联系顺丰快递上门取件；
3、收到资料后，客服专员会和您再次确认。'
),
(   null,
    'm2104.jpg',
    'm2104_l.jpg',
    '【新西兰】',
    399,
    '1、资料备齐后，您可以将资料发送客服为您审核；
2、审核无误后，客服专员会联系顺丰快递上门取件；
3、收到资料后，客服专员会和您再次确认。'
),
(   null,
    'm2145.jpeg',
    'm2145_l.jpg',
    '【澳大利亚】',
    940,
    '材料齐全后，3个工作日内送签
注意：旅游旺季前夕，受理时间有可能延长，建议您提早办理
审核通过后会短信告知，并于第二个工作日开始制作资料
如需补充资料客服人员会及时与您联系，请保持手机畅通！（节假日不审核）'
),
(   null,
    'm2341.jpeg',
    'm2341_l.jpg',
    '【菲律宾】',
    217,
    '1. 护照有效期在6个月以上；
2. 护照需至少2页以上的空白页；
3. 近6个月内拍摄的白底彩照2张；
4. 尺寸=2寸'
),
(   null,
    'm5213.jpeg',
    'm5213_l.jpg',
    '英国',
    860,
    '1.） 存款证明（原件）*
2. ）房产证或购房发票（原件及复印件）
3.） 工资卡或退休金或活期银行卡对帐单（原件）*
4.） 机动车行驶证或机动车登记证（复印件）'
),
(   null,
    'm8234.jpg',
    'm8234_l.jpeg',
    '【日本】',
    269,
    '1.赴日申请表（有模板）
2.户口本（整本复印件）
3.身份证（复印件）
4.因私护照（原件）
5.照片（近半年2寸白底彩照2张）'
),
(   null,
    'p1028.jpeg',
    'p1028_l.jpg',
    '【柬埔寨】',
    215,
    '1.有效期6个月以上，至少3页空白页，完整无损，无水迹
2.2张近期6个月内的白底2寸（3.5cm*4.5cm)彩照，在相片后面用铅笔注明名字
'
),
(   null,
    'p1034.jpeg',
    'p1034_l.jpg',
    '【美国】',
    1138,
    '1.旅行结束后有效期在6个月以上的因私护照首页复印件. 
2.请在护照最后一页签名(中文姓名). 
3.持换发护照者，需同时提供所有旧护照复印件.'
),
(   null,
    'p1482.jpeg',
    'p1482_l.jpg',
    '【意大利】',
    620,
    '1.护照完整无破损、无水渍和其他污渍
2.护照有效期距离出发日期超过6个月
3.至少有两页完整连续的空白页，不包含备注页
4.旧版护照，10岁以上（含10岁) 申请者护照签字处必须本人签字，10岁以下未成年人护照签字页无需签字，也可以签字（但必须护照持有人本人签）'

),
(   null,
    'p2132.jpeg',
    'p2132_l.jpg',
    '【俄罗斯】',
    670,
    '1.有效期9个月以上，至少3页空白页，完整无损，无水迹
2.2张近期6个月内的白底2寸（3.5cm*4.5cm)彩照，在相片后面用铅笔注明名字
'
),
(   null,
    'p2314.png',
    'p2314_l.png',
    '【澳大利亚】',
    1380,
    '澳大利亚1年多次旅游签证（急速出签+1对1专业签证顾问服务+顺丰包邮+拒签退500+免申请表+电子材料免费打印+海外保险+全程信息保密）'
),
(   null,
    'p1011.jpeg',
    'p1011_l.jpg',
    '【越南】',
    235,
    '签证通常在晚上出签后到达公司，常顺专属客服会第一时间通知您，将在第二天上午寄出，您可以选择自取或者邮寄~
本店默认选择顺丰快递（邮费均由客人承担）；如顺丰快递不能到达的地方请提前跟客服说，或者纸条上注明，我们将会选择EMS快递寄出'
);
/*用户表*/
CREATE TABLE ay_users(
    userid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    uname VARCHAR(20),                     /*用户名*/
    pwd VARCHAR(20),                       /*密码*/
    phone VARCHAR(20)                      /*电话*/
);
INSERT INTO ay_users VALUES
(NULL,'mary','11111','13111112345'),
(NULL,'jerry','22222','13819196547'),
(NULL,'john','33333','13819196547');
/*订单表*/
CREATE TABLE ay_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,     /*订单ID*/
    userid INT,                             /*用户*/
    phone VARCHAR(16),                      /*联系电话*/
    user_name VARCHAR(16),                  /*收货方用户名*/
    order_time LONG,                        /*下单时间*/
    addr VARCHAR(256),                      /*订单地址*/
    totalprice DOUBLE(6,2)                   /*订单总价*/
);
INSERT INTO ay_order VALUES
(NULL,1,'13501234567','大旭',1445154859209,'大钟寺中鼎B座',20.5),
(NULL,1,'13501257543','琳妹妹',1445154997543,'大钟寺中鼎B座',12.5),
(NULL,2,'13207654321','东东',1445254997612,'大钟寺中鼎B座',55),
(NULL,2,'13899999999','文兄',1445354959209,'大钟寺中鼎B座',35),
(NULL,3,'13683675299','梅姐',1445355889209,'大钟寺中鼎B座',45);
/**购物车表**/
CREATE TABLE ay_cart(
    ctid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    userid INT,                          /*用户编号：假定有用户id为 1 和 3 的两个用户有数据*/
    did INT,                             /*产品编号*/
    dishCount INT                      /*数量*/
);
INSERT INTO ay_cart VALUES (1,1,1,1),
(2,1,2,4),
(3,1,5,2),
(4,3,2,10),
(5,3,6,1);
##SELECT * FROM ay_order;
/**订单详情表**/
CREATE TABLE ay_orderdetails(
    oid INT ,                            /*订单编号*/
    did INT,                             /*产品id*/
    dishCount INT,                     /*购买数量*/
    price FLOAT(8,2)                     /*产品单价：需要记载，因为产品价格可能波动*/
);
INSERT INTO ay_orderdetails VALUES (1,1,2,5),
(1,2,1,10.5),
(2,3,1,12.5),
(3,1,3,5),
(3,2,4,10),
(4,4,7,5),
(5,5,5,4),
(5,6,2,12.5);
